pjclavero/Diana/firmware/esp32/main/app_tasks.c
/**
 * @file app_tasks.c
 * @brief Tareas principales del modulo (dosier 13.2).
 */
#include "app.h"

/* diana_is_uuid(): el resultado de mantenimiento no se publica sin un
 * request_id valido con que correlarlo. */
#include "diana/ids.h"

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "esp_log.h"
#include "esp_task_wdt.h"
#include "esp32s3_proto_do_w5500.h"
#include "driver/gpio.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

static const char *TAG = "diana.task";

#define SENSOR9_BITS_PATTERN "%c%c%c%c%c%c%c%c%c"
#define SENSOR9_BITS(bitmap) \
    ((bitmap) & (1u << 8) ? '1' : '0'), \
    ((bitmap) & (1u << 7) ? '1' : '0'), \
    ((bitmap) & (1u << 6) ? '1' : '0'), \
    ((bitmap) & (1u << 5) ? '1' : '0'), \
    ((bitmap) & (1u << 4) ? '1' : '0'), \
    ((bitmap) & (1u << 3) ? '1' : '0'), \
    ((bitmap) & (1u << 2) ? '1' : '0'), \
    ((bitmap) & (1u << 1) ? '1' : '0'), \
    ((bitmap) & (1u << 0) ? '1' : '0')

#define SENSOR16_BITS_PATTERN "%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c%c"
#define SENSOR16_BITS(bitmap) \
    ((bitmap) & (1u << 15) ? '1' : '0'), \
    ((bitmap) & (1u << 14) ? '1' : '0'), \
    ((bitmap) & (1u << 13) ? '1' : '0'), \
    ((bitmap) & (1u << 12) ? '1' : '0'), \
    ((bitmap) & (1u << 11) ? '1' : '0'), \
    ((bitmap) & (1u << 10) ? '1' : '0'), \
    ((bitmap) & (1u << 9) ? '1' : '0'), \
    ((bitmap) & (1u << 8) ? '1' : '0'), \
    ((bitmap) & (1u << 7) ? '1' : '0'), \
    ((bitmap) & (1u << 6) ? '1' : '0'), \
    ((bitmap) & (1u << 5) ? '1' : '0'), \
    ((bitmap) & (1u << 4) ? '1' : '0'), \
    ((bitmap) & (1u << 3) ? '1' : '0'), \
    ((bitmap) & (1u << 2) ? '1' : '0'), \
    ((bitmap) & (1u << 1) ? '1' : '0'), \
    ((bitmap) & (1u << 0) ? '1' : '0')

/* --------------------------------------------------------------- entradas */

void diana_task_inputs(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);

    int selector_candidate = -1;
    int selector_stable = -1;
    uint8_t selector_samples = 0;
    bool button_candidate = a->hal.button_pressed(a->hal.ctx);
    bool button_stable = button_candidate;
    uint8_t button_samples = 0;
    a->identify_button_active = button_stable;

    for (;;) {
        esp_task_wdt_reset();

        int s1 = gpio_get_level(DIANA_PIN_SELECTOR_A);
        int s2 = gpio_get_level(DIANA_PIN_SELECTOR_B);
        int selector_raw = (s1 << 1) | s2;
        if (selector_raw != selector_candidate) {
            selector_candidate = selector_raw;
            selector_samples = 1;
        } else if (selector_samples < 3) {
            selector_samples++;
        }
        if (selector_samples == 3 && selector_stable != selector_candidate) {
            diana_selector_position sel;
            if (diana_selector_decode(s1, s2, DIANA_SELECTOR_PROFILE, &sel) ==
                DIANA_HAL_OK) {
                a->selector = sel;
                a->role = diana_role_from_selector(sel);
                ESP_LOGI(TAG, "SELECTOR GPIO15=%d GPIO16=%d mode=%s", s1, s2,
                         diana_selector_str(sel));

                /* ROL DE COORDINADOR, atado al selector ESTABLE (tres muestras
                 * iguales). El transito entre contactos de un SPDT pasa por
                 * 1,1 durante 180-420 ms --- medido en el banco --- y NO
                 * concede autoridad: `diana_selector_decode` lo rechaza y esta
                 * rama no se ejecuta.
                 *
                 * Al salir de PRINCIPAL se DESUSCRIBE y se olvida la partida:
                 * dejar de coordinar tiene que ser inmediato, no "dejar de
                 * atender pero seguir escuchando". */
                bool principal = (sel == DIANA_SELECTOR_PRINCIPAL);
                if (!principal) diana_coordinator_reset(&a->coord);
                diana_platform_mqtt_set_coordinator(a->pf, principal,
                                                    a->id.system_id);
            } else {
                ESP_LOGE(TAG, "SELECTOR GPIO15=%d GPIO16=%d mode=INVALID_SELECTOR",
                         s1, s2);
            }
            selector_stable = selector_candidate;
        }

        bool button = a->hal.button_pressed(a->hal.ctx);
        if (button != button_candidate) {
            button_candidate = button;
            button_samples = 1;
        } else if (button_samples < 3) {
            button_samples++;
        }
        if (button_samples == 3 && button_stable != button_candidate) {
            button_stable = button_candidate;
            a->identify_button_active = button_stable;
            ESP_LOGI(TAG, "IDENTIFY GPIO17=%s",
                     button_stable ? "LOW" : "HIGH");
        }

        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

/* --------------------------------------------------------------- publicacion */

static void publish(diana_app *a, const char *topic, const char *json,
                    size_t len, diana_topic t)
{
    diana_hal_mqtt_msg msg = {
        .topic = topic,
        .payload = json,
        .payload_len = len,
        .qos = diana_topic_qos(t),
        .retain = diana_topic_retain(t),
    };
    a->hal.mqtt_publish(a->hal.ctx, &msg);
}

static char *alloc_message_buffer(void)
{
    char *buf = malloc(DIANA_MSG_JSON_MAX);
    if (!buf) ESP_LOGE(TAG, "sin memoria para serializar mensaje JSON");
    return buf;
}

void diana_publish_presence(diana_app *a, diana_presence_reason reason)
{
    diana_hal_net_status net;
    a->hal.net_status(a->hal.ctx, &net);
    char buf[1024];
    size_t n = diana_presence_json(&a->id, reason, &net, buf, sizeof(buf));
    if (n) publish(a, a->topic_presence, buf, n, DIANA_TOPIC_PRESENCE);
}

void diana_publish_status(diana_app *a)
{
    diana_status_input in;
    memset(&in, 0, sizeof(in));
    in.id = &a->id;
    in.fsm = &a->fsm;
    in.targets = &a->targets;
    in.cfg = &a->cfg;
    in.selector = a->selector;
    in.role = a->role;
    in.queue_depth = diana_queue_depth(&a->queue);
    in.uptime_s = (a->hal.now_us(a->hal.ctx) - a->boot_us) / 1000000ULL;
    in.has_last_command = a->has_last_command;
    memcpy(in.last_command_id, a->last_command_id, sizeof(in.last_command_id));
    in.last_command_result = diana_command_result_str(a->last_command_result);
    in.last_command_detail = a->last_command_detail;

    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_status_json(&in, buf, DIANA_MSG_JSON_MAX);
    if (n) publish(a, a->topic_status, buf, n, DIANA_TOPIC_STATUS);
    free(buf);
}

void diana_publish_command_rejected(diana_app *a, const char *command_id,
                                    diana_command_reject_reason reason,
                                    const char *message)
{
    diana_diagnostic d;
    if (!diana_diagnostic_command_rejected(&d, &a->hal, command_id, reason,
                                           message)) {
        /* Sin UUID con que correlar esto no es un rechazo de comando, es un
         * sobre mal formado. Se dice lo que es en vez de inventar un
         * request_id para que el validador se ponga verde. */
        diana_publish_diagnostic(a, DIANA_DIAG_SCHEMA_REJECTED,
                                 DIANA_SEV_WARNING,
                                 "comando rechazado sin command_id valido: "
                                 "incorrelable");
        return;
    }
    /* Buffer en heap, como el resto de publicadores tras el fix de
     * desbordamiento de pila del banco 2026-08-24. */
    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_diagnostic_json(&d, &a->id,
                                     a->hal.now_us(a->hal.ctx) - a->boot_us,
                                     buf, DIANA_MSG_JSON_MAX);
    if (n) publish(a, a->topic_diagnostic, buf, n, DIANA_TOPIC_DIAGNOSTIC);
    else   ESP_LOGE(TAG, "diagnostico '%s' NO serializado: se descarta",
                    diana_diagnostic_kind_str(d.kind));
    free(buf);
}

void diana_publish_module_command(diana_app *a, const diana_coord_plan *plan)
{
    if (!a || !plan || !plan->emit_command) return;

