pjclavero/Diana/firmware/esp32/main/app_tasks.c
    char command_id[DIANA_UUID_LEN];
    diana_uuid4(&a->hal, command_id);

    char *buf = alloc_message_buffer();
    if (!buf) return;
    /* TTL corto: una orden de juego que llega tarde ya no sirve, y el receptor
     * la rechazaria por 6-bis. 5 s cubre de sobra la red del banco. */
    size_t n = diana_coord_module_command_json(
        plan, command_id, a->hal.epoch_ms ? a->hal.epoch_ms(a->hal.ctx) : 0,
        5000, buf, DIANA_MSG_JSON_MAX);
    if (n) {
        char topic[DIANA_TOPIC_MAXLEN];
        diana_topic_build(topic, sizeof(topic), DIANA_TOPIC_COMMAND,
                          plan->command_module_id);
        publish(a, topic, buf, n, DIANA_TOPIC_COMMAND);
        ESP_LOGI(TAG, "COORDINADOR -> %s: diana %u activa",
                 plan->command_module_id, (unsigned)plan->active_target_index);
    } else {
        ESP_LOGE(TAG, "comando de coordinador NO serializado: se descarta");
    }
    free(buf);
}

void diana_publish_game_state(diana_app *a, const diana_coord_plan *plan)
{
    if (!a || !plan || !plan->emit_state) return;

    char *buf = alloc_message_buffer();
    if (!buf) return;
    uint64_t ahora = a->hal.now_us(a->hal.ctx);
    size_t n = diana_coord_game_state_json(
        &a->coord, plan, a->id.system_id, a->id.module_id,
        ahora - a->boot_us, ahora, ahora - a->boot_us,
        a->id.boot_id, buf, DIANA_MSG_JSON_MAX);
    if (n) {
        char topic[DIANA_TOPIC_MAXLEN];
        diana_system_topic_build(topic, sizeof(topic), DIANA_SYS_TOPIC_GAME_STATE,
                                 a->id.system_id);
        /* QoS 1 y RETENIDO por contrato (game-state.schema.json). No pasa por
         * diana_topic_retain() porque ese enum describe los topicos de MODULO:
         * meter game/state alli permitiria construir `module/x/game/state`, que
         * no existe. */
        diana_hal_mqtt_msg msg = {
            .topic = topic, .payload = buf, .payload_len = n,
            .qos = 1, .retain = true,
        };
        a->hal.mqtt_publish(a->hal.ctx, &msg);
    } else {
        ESP_LOGE(TAG, "game/state NO serializado: se descarta");
    }
    free(buf);
}

void diana_publish_maintenance_result(diana_app *a, const char *request_id,
                                      const char *component, int target_index,
                                      uint32_t duration_ms)
{
    diana_diagnostic d;
    diana_diagnostic_init(&d, &a->hal, DIANA_DIAG_SELF_TEST_RESULT,
                          DIANA_SEV_INFO, "orden de mantenimiento ejecutada");

    /* Sin UUID con que correlar, este resultado no sirve para nada: el panel no
     * podria distinguirlo de la respuesta a otra orden. Se calla en vez de
     * publicar algo incorrelable, igual que hace el rechazo. */
    if (!request_id || !diana_is_uuid(request_id)) {
        ESP_LOGW(TAG, "resultado de mantenimiento sin request_id valido: "
                      "no se publica (seria incorrelable)");
        return;
    }
    d.has_request_id = true;
    snprintf(d.request_id, sizeof(d.request_id), "%s", request_id);

    d.detail_keys[d.detail_count] = "result";
    d.detail_str[d.detail_count++] = "ok";
    d.detail_keys[d.detail_count] = "component";
    d.detail_str[d.detail_count++] = component;
    if (target_index > 0) {
        d.detail_keys[d.detail_count] = "target_index";
        d.detail_str[d.detail_count] = NULL;
        d.detail_num[d.detail_count++] = target_index;
    }
    if (duration_ms > 0) {
        d.detail_keys[d.detail_count] = "duration_ms";
        d.detail_str[d.detail_count] = NULL;
        d.detail_num[d.detail_count++] = (int64_t)duration_ms;
    }

    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_diagnostic_json(&d, &a->id,
                                     a->hal.now_us(a->hal.ctx) - a->boot_us,
                                     buf, DIANA_MSG_JSON_MAX);
    /* Un diagnostico que no serializa se DICE. El silencio de este camino es
     * lo que oculto durante toda una tanda que los rechazos de mantenimiento
     * no salian del modulo: el serializador los rechazaba por incorrelables
     * --- con razon --- y aqui se tiraban sin dejar rastro. */
    if (n) publish(a, a->topic_diagnostic, buf, n, DIANA_TOPIC_DIAGNOSTIC);
    else   ESP_LOGE(TAG, "diagnostico '%s' NO serializado: se descarta",
                    diana_diagnostic_kind_str(d.kind));
    free(buf);
}

void diana_publish_diagnostic(diana_app *a, diana_diagnostic_kind kind,
                              diana_severity sev, const char *message)
{
    diana_diagnostic d;
    diana_diagnostic_init(&d, &a->hal, kind, sev, message);
    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_diagnostic_json(&d, &a->id,
                                     a->hal.now_us(a->hal.ctx) - a->boot_us,
                                     buf, DIANA_MSG_JSON_MAX);
    /* Un diagnostico que no serializa se DICE. El silencio de este camino es
     * lo que oculto durante toda una tanda que los rechazos de mantenimiento
     * no salian del modulo: el serializador los rechazaba por incorrelables
     * --- con razon --- y aqui se tiraban sin dejar rastro. */
    if (n) publish(a, a->topic_diagnostic, buf, n, DIANA_TOPIC_DIAGNOSTIC);
    else   ESP_LOGE(TAG, "diagnostico '%s' NO serializado: se descarta",
                    diana_diagnostic_kind_str(d.kind));
    free(buf);
}

void diana_publish_config_reported(diana_app *a)
{
    char *buf = alloc_message_buffer();
    if (!buf) return;
    size_t n = diana_config_reported_json(&a->cfg, a->id.module_id, NULL, buf,
                                          DIANA_MSG_JSON_MAX);
    if (n) publish(a, a->topic_config_reported, buf, n,
                   DIANA_TOPIC_CONFIG_REPORTED);
    free(buf);
}

/* ------------------------------------------------------------------ sensores */

/** Publica el evento, o lo encola si no hay red (dosier 14.3). */
static void emit_hit(diana_app *a, const diana_hit_event *ev)
{
    if (diana_hit_event_check(ev) != DIANA_HAL_OK) {
        /* Un evento que no cumple el contrato NO se envia: se registra. */
        diana_publish_diagnostic(a, DIANA_DIAG_SCHEMA_REJECTED, DIANA_SEV_ERROR,
                                 "evento propio no conforme: descartado");
        return;
    }

    char json[DIANA_HIT_JSON_MAX];
    size_t n = diana_hit_event_to_json(ev, json, sizeof(json));
    if (n == 0) return;

    if (a->hal.mqtt_connected(a->hal.ctx)) {
        diana_hal_mqtt_msg msg = {a->topic_hit, json, n, 1, false};
        if (a->hal.mqtt_publish(a->hal.ctx, &msg) >= 0) {
            diana_queue_remember(&a->queue, ev->event_id);
            return;
        }
    }
    int rc = diana_queue_push(&a->queue, ev);
    if (rc == DIANA_HAL_ERR_NO_SPACE) {
        diana_publish_diagnostic(a, DIANA_DIAG_QUEUE_OVERFLOW, DIANA_SEV_ERROR,
                                 "cola local llena: evento perdido");
    }
}

