pjclavero/Diana/firmware/esp32/main/app_tasks.c
void diana_task_sensors(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);
    uint16_t last_logged_raw = 0xffffu;
    uint16_t last_logged_used = 0xffffu;
    uint64_t last_diag_us = 0;

    for (;;) {
        esp_task_wdt_reset();

        diana_platform_trigger t;
        bool got = diana_platform_trigger_pop(a->pf, &t, DIANA_HC165_POLL_MS);
        if (!got) continue;

        uint16_t used_raw = (uint16_t)(t.raw_bitmap & 0x01ffu);
        bool used_changed = used_raw != last_logged_used;
        bool raw_changed = t.raw_bitmap != last_logged_raw;
        bool diag_due = (t.t_us - last_diag_us) >= 250000ULL;
        if (used_changed || (raw_changed && diag_due)) {
            diana_do_snapshot snap;
            diana_do_decode(t.raw_bitmap, DIANA_DO_POLARITY, &snap);
            uint16_t active_high = diana_do_active_bitmap(t.raw_bitmap,
                                                          DIANA_DO_ACTIVE_HIGH);
            uint16_t active_low = diana_do_active_bitmap(t.raw_bitmap,
                                                         DIANA_DO_ACTIVE_LOW);
            ESP_LOGI(TAG, "SENSORES raw=0x%04x bits16=" SENSOR16_BITS_PATTERN
                     " raw D9..D1=" SENSOR9_BITS_PATTERN
                     " AH=" SENSOR9_BITS_PATTERN
                     " AL=" SENSOR9_BITS_PATTERN
                     " cfg=%s count=%u",
                     (unsigned)t.raw_bitmap, SENSOR16_BITS(t.raw_bitmap),
                     SENSOR9_BITS(used_raw),
                     SENSOR9_BITS(active_high),
                     SENSOR9_BITS(active_low),
                     DIANA_DO_POLARITY == DIANA_DO_ACTIVE_HIGH ? "AH" : "AL",
                     (unsigned)snap.active_count);
            last_logged_raw = t.raw_bitmap;
            last_logged_used = used_raw;
            last_diag_us = t.t_us;
        }

        diana_hit_group grp;
        diana_do_process_snapshot(&a->sensors, &a->cfg, t.raw_bitmap,
                                  DIANA_DO_POLARITY, t.t_us, &grp);

        if (!grp.accepted) {
            if (grp.target_index == 0 && strstr(grp.reason, "MULTI_TRIGGER") != NULL)
                diana_publish_diagnostic(a, DIANA_DIAG_SENSOR_ERROR,
                                         DIANA_SEV_WARNING, grp.reason);
            continue;
        }

        diana_target *tg = diana_target_at(&a->targets, grp.target_index);
        if (!tg) continue;
        diana_target_state before = tg->state;
        uint64_t now = a->hal.now_us(a->hal.ctx);

        /* Clasificacion segun el estado de la diana y de la partida. */
        if (a->fsm.state == DIANA_MODULE_GAME_PAUSED) {
            grp.classification = DIANA_HIT_DURING_PAUSE;
            snprintf(grp.reason, sizeof(grp.reason), "partida en pausa");
        } else if (a->fsm.state == DIANA_MODULE_CALIBRATION) {
            grp.classification = DIANA_HIT_CALIBRATION;
            snprintf(grp.reason, sizeof(grp.reason), "impacto de calibracion");
        } else if (before == DIANA_TARGET_SAFE) {
            grp.classification = DIANA_HIT_ON_SAFE;
            snprintf(grp.reason, sizeof(grp.reason), "diana en estado seguro");
            diana_target_apply(tg, DIANA_TEV_HIT_PENALTY, now);
        } else if (before == DIANA_TARGET_HIT) {
            grp.classification = DIANA_HIT_ON_ALREADY_HIT;
            snprintf(grp.reason, sizeof(grp.reason), "diana ya alcanzada");
        } else if (!diana_target_is_scorable(tg)) {
            grp.classification = DIANA_HIT_OUT_OF_ORDER;
            snprintf(grp.reason, sizeof(grp.reason), "diana no activa (%s)",
                     diana_target_state_str(before));
        } else {
            diana_target_apply(tg, DIANA_TEV_HIT_VALID, now);
        }

        diana_hit_event ev;
        diana_hit_event_build(&ev, &a->hal, &a->id, &grp, before, now);
        if (a->cfg.has_position) {
            ev.has_position = true;
            ev.position_x = a->cfg.position_x;
            ev.position_y = a->cfg.position_y;
        }
        ev.has_rotation = true;
        ev.rotation = a->cfg.rotation;
        emit_hit(a, &ev);

        /* Los vecinos descartados se publican para poder auditar la decision. */
        for (uint8_t i = 0; i < grp.rejected_count; ++i) {
            diana_hit_event rej;
            const diana_target *rtg =
                diana_target_at_const(&a->targets, grp.rejected_index[i]);
            if (diana_hit_event_build_rejected(&rej, &a->hal, &a->id, &grp, i,
                                               rtg ? rtg->state : DIANA_TARGET_OFF,
                                               now))
                emit_hit(a, &rej);
        }
    }
}

/* ---------------------------------------------------------------------- LED */

void diana_task_leds(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);

    for (;;) {
        esp_task_wdt_reset();
        uint64_t now = a->hal.now_us(a->hal.ctx);
        uint64_t t_ms = now / 1000ULL;

        if (a->identify_active && now > a->identify_until_us)
            a->identify_active = false;
        /* Cada diana caduca por su cuenta: el vencimiento de una no puede
         * apagar a otra. Se construye aqui la mascara que consume el render. */
        uint16_t test_mask = 0;
        for (uint8_t i = 0; i < DIANA_TARGET_COUNT; ++i) {
            if (a->led_test_until_us[i] == 0) continue;
            if (now > a->led_test_until_us[i]) {
                a->led_test_until_us[i] = 0;
                continue;
            }
            test_mask |= (uint16_t)(1u << i);
        }

#if CONFIG_DIANA_BENCH_HIT_LED_TEST
        for (uint8_t i = 0; i < 3; ++i) {
            diana_target *tg = &a->targets.t[i];
            if (tg->state == DIANA_TARGET_HIT &&
                now - tg->entered_at_us >= 1000000ULL) {
                diana_target_apply(tg, DIANA_TEV_HIT_CLEARED, now);
                diana_target_apply(tg, DIANA_TEV_ARM, now);
                ESP_LOGI(TAG, "BANCO D%u rearmada", (unsigned)(i + 1u));
            }
        }
#endif

        diana_target_state states[DIANA_TARGET_COUNT];
        for (int i = 0; i < DIANA_TARGET_COUNT; ++i)
            states[i] = a->targets.t[i].state;

        diana_hal_rgb px[DIANA_LED_CHAINS][DIANA_LEDS_PER_CHAIN];
        for (uint8_t c = 0; c < DIANA_LED_CHAINS; ++c)
            diana_led_render_chain(c, states,
                                   a->identify_active || a->identify_button_active,
                                   test_mask,
                                   a->cfg.led_brightness_max, t_ms, px[c]);

        /* Presupuesto de potencia ANTES de escribir: nunca se envia al hardware
         * un fotograma que exceda la corriente disponible (dosier 10.4). */
        diana_hal_rgb *chains[DIANA_LED_CHAINS] = {px[0], px[1], px[2]};
        diana_led_apply_budget(chains, DIANA_LEDS_PER_CHAIN, DIANA_LED_BUDGET_MA);

        for (uint8_t c = 0; c < DIANA_LED_CHAINS; ++c)
            a->hal.led_write(a->hal.ctx, c, px[c], DIANA_LEDS_PER_CHAIN);
        diana_platform_led_refresh(a->pf);

        vTaskDelay(pdMS_TO_TICKS(20));   /* 50 fps */
    }
}

/* ------------------------------------------------------------------- red */

