pjclavero/Diana/firmware/esp32/main/app_tasks.c
void diana_task_network(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);

    bool was_connected = false;

    for (;;) {
        esp_task_wdt_reset();
        bool connected = a->hal.mqtt_connected(a->hal.ctx);

        if (connected && !was_connected) {
            /* Reconexion: presencia, estado, config y vaciado de la cola. */
            a->mqtt_reconnects++;
            diana_module_fsm_apply(&a->fsm, DIANA_EV_MQTT_CONNECTED,
                                   a->hal.now_us(a->hal.ctx));
            diana_publish_presence(a, DIANA_PRESENCE_CONNECT);
            diana_module_fsm_apply(&a->fsm, DIANA_EV_REGISTERED,
                                   a->hal.now_us(a->hal.ctx));
            diana_publish_status(a);
            diana_publish_config_reported(a);
            /* v1.2 · ADR-0008: al (re)conectar se declara el estado de
             * autoridad si hay algo que declarar. Es reported state
             * observacional, jamas una orden. */
            diana_prov_app_announce(a);
            ESP_LOGI(TAG, "reconectado: vaciando %u eventos pendientes",
                     (unsigned)diana_queue_depth(&a->queue));
            /* La cola persistente se liga a la identidad ACTUAL en cada
             * conexion: si el modulo se reaprovisiono, lo que quedo dentro es
             * de otro y no puede salir en su nombre. */
            diana_queue_bind_identity(&a->queue, a->id.module_id, a->id.system_id);
        } else if (!connected && was_connected) {
            diana_module_fsm_apply(&a->fsm, DIANA_EV_MQTT_DISCONNECTED,
                                   a->hal.now_us(a->hal.ctx));
        }
        was_connected = connected;

        if (connected && diana_queue_depth(&a->queue) > 0) {
            /* Vaciado por lotes: no monopoliza la red ni el watchdog. */
            diana_queue_flush(&a->queue, a->topic_hit, 8);
            /* Diagnostico UNA sola vez: si se registrara en cada vaciado, una
             * cola con eventos de otra identidad llenaria el log para siempre
             * --- que es exactamente el sintoma que esto viene a cerrar. */
            if (a->queue.stale_identity > 0 && !a->queue.stale_reported) {
                a->queue.stale_reported = true;
                ESP_LOGW(TAG,
                         "cola: %u evento(s) retirados por pertenecer a OTRA "
                         "identidad; la actual es '%s'/'%s'",
                         (unsigned)a->queue.stale_identity, a->id.module_id,
                         a->id.system_id);
            }
        }

        /* FUERA DE LA PILA. Un diana_platform_rx son ~4.3 KB desde que el
         * buffer de recepcion se dimensiono contra el contrato, y la pila de
         * diana_net son 8 KB: en la placa esto desbordo con
         * "A stack overflow in task diana_net has been detected" justo despues
         * de las suscripciones, en cuanto llego el primer mensaje. `static` es
         * seguro porque diana_task_network es la UNICA tarea que ejecuta esta
         * funcion; si algun dia deja de serlo, hay que volver aqui. */
        static diana_platform_rx rx;
        while (diana_platform_rx_pop(a->pf, &rx, 20))
            diana_handle_message(a, &rx);

        /* Rollback automatico si la OTA no se confirma a tiempo. */
        diana_ota_tick(&a->ota, a->hal.now_us(a->hal.ctx));

        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

/* ------------------------------------------------------------- telemetria */

/* Cadencia de la lectura diagnostica de VERSIONR: 30 s. Ni se acopla a la
 * telemetria (1 s por defecto) ni necesita un bucle propio. */
#define DIANA_VERSIONR_PERIOD_US (30ULL * 1000ULL * 1000ULL)

void diana_task_telemetry(void *arg)
{
    diana_app *a = (diana_app *)arg;
    esp_task_wdt_add(NULL);
    uint64_t last_versionr_us = 0;
    /* Arranca en true para que el PRIMER paso por el bucle anuncie el estado
     * real: el modulo arranca siempre sin hora, y un "false -> false" silencioso
     * dejaria el caso normal sin registrar. */
    bool clock_valido_anterior = true;

    for (;;) {
        esp_task_wdt_reset();

        diana_telemetry_input in;
        memset(&in, 0, sizeof(in));
        in.id = &a->id;
        uint64_t now = a->hal.now_us(a->hal.ctx);
        in.uptime_us = now - a->boot_us;
        in.uptime_s = in.uptime_us / 1000000ULL;
        a->hal.health(a->hal.ctx, &in.health);

        diana_hal_net_status net;
        a->hal.net_status(a->hal.ctx, &net);
        in.link_up = net.link_up;
        in.mqtt_reconnects = a->mqtt_reconnects;
        in.queue_depth = diana_queue_depth(&a->queue);
        for (int c = 0; c < DIANA_LED_CHAINS; ++c) in.chain_ok[c] = true;
        in.has_chain_current = false;   /* sin medida real de corriente por cadena */

        char *buf = alloc_message_buffer();
        size_t n = buf ? diana_telemetry_json(&in, buf, DIANA_MSG_JSON_MAX) : 0;
        if (n) publish(a, a->topic_telemetry, buf, n, DIANA_TOPIC_TELEMETRY);
        free(buf);

        if (in.health.has_voltage && in.health.voltage_5v_mv < 4600) {
            diana_publish_diagnostic(a, DIANA_DIAG_LOW_VOLTAGE, DIANA_SEV_WARNING,
                                     "5V por debajo de 4,6 V");
        }

        /* VERSIONR con cadencia PROPIA y lenta, decimada dentro de la tarea de
         * telemetria. Deliberadamente NO se ata a telemetry_interval_ms, que
         * por defecto es 1000 ms: leer un registro por SPI una vez por segundo
         * seria sondeo agresivo y competiria con el trafico del driver. Es UNA
         * lectura cada DIANA_VERSIONR_PERIOD_US, por el mismo camino SPI y bajo
         * el mismo mutex. Sirve para detectar en caliente una degradacion
         * 0x04 -> 0x00 durante la endurance, invisible de otro modo. */
        /* CLOCK_VALID observable. Sin esto, "el modulo no tiene hora" solo se
         * podia deducir de que los comandos 'act' se rechazaban --- es decir,
         * por su consecuencia y no por su causa. La transicion se anuncia UNA
         * vez, para no convertir el log en un goteo. */
        {
            uint64_t epoch = a->hal.epoch_ms ? a->hal.epoch_ms(a->hal.ctx) : 0;
            bool valido = (epoch > 0);
            if (valido != clock_valido_anterior) {
                clock_valido_anterior = valido;
                if (valido)
                    ESP_LOGI(TAG, "CLOCK_VALID=true (epoch_ms=%llu): la caducidad "
                                  "de comandos ya se verifica",
                             (unsigned long long)epoch);
                else
                    ESP_LOGW(TAG, "CLOCK_VALID=false: sin hora de pared; el "
                                  "repertorio 'act' de mantenimiento se rechaza");
            }
        }

        if (now - last_versionr_us >= DIANA_VERSIONR_PERIOD_US) {
            last_versionr_us = now;
            uint8_t vr = 0;
            diana_w5500_version_class vcls = DIANA_W5500_VERSION_READ_ERROR;
            int vrc = diana_platform_eth_versionr(a->pf, &vr, &vcls);
            if (vrc == 0 && vcls == DIANA_W5500_VERSION_OK) {
                ESP_LOGI(TAG, "W5500 VERSIONR=0x%02x (%s)", (unsigned)vr,
                         diana_w5500_version_class_str(vcls));
            } else if (vrc != -1) {
                ESP_LOGW(TAG, "W5500 VERSIONR=0x%02x (%s)", (unsigned)vr,
                         diana_w5500_version_class_str(vcls));
            }
        }

        vTaskDelay(pdMS_TO_TICKS(a->cfg.telemetry_interval_ms));
    }
}
